tap "homebrew/bundle"
tap "homebrew/services"
brew "autoconf"
brew "bitwarden-cli"
brew "bottom"
brew "clisp"
brew "elixir"
brew "gh"
brew "helm"
brew "jenv"
brew "jq"
brew "k9s"
brew "lolcat"
brew "minikube"
brew "mono-libgdiplus"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "openjdk"
brew "pkgconf"
brew "postgresql@14"
brew "pyenv"
brew "python@3.10"
brew "qemu"
brew "ranger"
brew "rbenv"
brew "ripgrep"
brew "swi-prolog"
brew "tfenv"
brew "thefuck"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "wireguard-tools"
cask "adguard"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "alfred"
cask "amethyst"
cask "bitwarden"
cask "crystalfetch"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "font-fira-code"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "minecraft"
cask "obsidian"
cask "postman"
cask "prismlauncher"
cask "retroarch"
cask "signal"
cask "spotify"
cask "steam"
cask "utm"
cask "visual-studio-code"
cask "zoom"
vscode "cschlosser.doxdocgen"
vscode "dafny-lang.ide-vscode"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "eamodio.gitlens"
vscode "jakebecker.elixir-ls"
vscode "justusadam.language-haskell"
vscode "lehni.vscode-fix-checksums"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ocamllabs.ocaml-platform"
vscode "pkief.material-icon-theme"
vscode "rust-lang.rust-analyzer"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vscodevim.vim"
