# Brew repositories
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Packages
brew "autoconf"
brew "bitwarden-cli"
brew "btop"
brew "clisp"
brew "elixir"
brew "gh"
brew "ghc"
brew "haskell-language-server"
brew "jq"
brew "lolcat"
brew "mono-libgdiplus"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "openjdk"
brew "postgresql@14"
brew "pyenv"
brew "python@3.10"
brew "qemu"
brew "ranger"
brew "swi-prolog"
brew "thefuck"
brew "tmux"
brew "tree"
brew "wget"
brew "wireguard-tools"

# Casks (i.e. apps)
cask "alfred"
cask "amethyst"
cask "android-studio"
cask "discord"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "iterm2"
cask "microsoft-teams"
cask "minecraft"
cask "multipatch"
cask "obsidian"
cask "openemu"
cask "postman"
cask "signal"
cask "smlnj"
cask "spotify"
cask "utm"
cask "visual-studio-code"
cask "zoom"

# VSCode plugins?
vscode "cschlosser.doxdocgen"
vscode "dafny-lang.ide-vscode"
vscode "eamodio.gitlens"
vscode "JakeBecker.elixir-ls"
vscode "justusadam.language-haskell"
vscode "lehni.vscode-fix-checksums"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ocamllabs.ocaml-platform"
vscode "PKief.material-icon-theme"
vscode "rust-lang.rust-analyzer"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vscodevim.vim"

